aws/amazon-freertos/vendors/cypress/psoc6/mw/capsense/cy_capsense_csx.h
#define CY_CAPSENSE_DEFAULT_CSD_CONFIG_CFG                 (CY_CAPSENSE_CONFIG_DEFAULT_FILTER_DELAY_CFG |\
                                                            CY_CAPSENSE_CONFIG_DEFAULT_MUTUAL_CFG |\
                                                            CY_CAPSENSE_CONFIG_DEFAULT_DUAL_CNT_CFG |\
                                                            CY_CAPSENSE_CONFIG_DEFAULT_EN_CFG)


/* +--------+---------------+----------------------------------------------------------------------------------------+
 * |  BITS  |   FIELD       |              MODE                                                                      |
 * |--------|---------------|----------------------------------------------------------------------------------------|
 * | 1      | SAMPLE        | 0x01(Clear CSD End Of Scan interrupt)                                                  |
 * | 2      | INIT          | 0x01(Clear CSD End Of Coarse Init interrupt)                                           |
 * | 8      | ADC_RES       | 0x01(Clear ADC End Of Scan interrupt)                                                  |
 * +--------+---------------+----------------------------------------------------------------------------------------+*/
#define CY_CAPSENSE_DEFAULT_CSD_INTR_CFG                   (CY_CAPSENSE_CSD_INTR_ALL_MSK)

/* +--------+---------------+----------------------------------------------------------------------------------------+
 * |  BITS  |   FIELD       |              MODE                                                                      |
 * |--------|---------------|----------------------------------------------------------------------------------------|
 * | 1      | SAMPLE        | 0x00(CSD End Of Scan interrupt is cleared)                                             |
 * | 2      | INIT          | 0x00(CSD End Of Coarse Init interrupt is cleared)                                      |
 * | 8      | ADC_RES       | 0x00(ADC End Of Scan interrupt is cleared)                                             |
 * +--------+---------------+----------------------------------------------------------------------------------------+*/
#define CY_CAPSENSE_DEFAULT_CSD_INTR_SET_CFG               (0x00000000uL)

/* +--------+---------------+----------------------------------------------------------------------------------------+
 * |  BITS  |   FIELD       |              MODE                                                                      |
 * |--------|---------------|----------------------------------------------------------------------------------------|
 * | 1      | SAMPLE        | 0x01(CSD End Of Scan interrupt is masked)                                              |
 * | 2      | INIT          | 0x00(CSD End Of Coarse Init interrupt is cleared)                                       |
 * | 8      | ADC_RES       | 0x00(ADC End Of Scan interrupt is cleared)                                              |
 * +--------+---------------+----------------------------------------------------------------------------------------+*/
#define CY_CAPSENSE_DEFAULT_CSD_INTR_MASK_CFG              (CY_CAPSENSE_CSD_INTR_MASK_SAMPLE_MSK)

/* +--------+---------------+----------------------------------------------------------------------------------------+
 * |  BITS  |   FIELD       |              MODE                                                                      |
 * |--------|---------------|----------------------------------------------------------------------------------------|
 * |  0     |  HSCMP_EN     | 0x00(High Speed comparator is disabled)                                                |
 * |  4     |  HSCMP_INVERT | 0x00(High Speed comparator output is not inverted)                                     |
 * |  31    |  AZ_EN        | 0x00(Auto-Zero is disabled)                                                            |
 * +--------+---------------+----------------------------------------------------------------------------------------+*/
#define CY_CAPSENSE_DEFAULT_CSD_HSCMP_CFG                  (0x00000000uL)

/* +--------+---------------+----------------------------------------------------------------------------------------+
 * |  BITS  |   FIELD       |              MODE                                                                      |
 * |--------|---------------|----------------------------------------------------------------------------------------|
 * |  1:0   | PWR_MODE      | 0x00(Amux buffer is disabled)                                                          |
 * +--------+---------------+----------------------------------------------------------------------------------------+*/
#define CY_CAPSENSE_DEFAULT_CSD_AMBUF_CFG                  (0x00000000uL)

/* +--------+---------------+------------------------------------------+---------------------------------------------+
 * |        |               |           VDDA >= 2V                     |          VDDA <2V                           |
 * +  BITS  +   FIELD       +------------------------------------------+---------------------------------------------+
 * |        |               |              MODE                        |             MODE                            |
 * |--------|---------------|------------------------------------------|---------------------------------------------|
 * |  0     | REFGEN_EN     | 0x01(Reference generator is enabled)     | 0x01(Reference generator is enabled)        |
 * |  4     | BYPASS        | 0x00(BYPASS mode switch is open)         | 0x00(BYPASS mode switch is open)            |
 * |  5     | VDDA_EN       | 0x00(VDDA mode switch is open)           | 0x00(VDDA mode switch is open)              |
 * |  6     | RES_EN        | 0x01(Resistor string is enabled)         | 0x01(Resistor string is enabled)            |
 * |  12:08 | GAIN          | 0x1F(Gain = 31)                          | 0x15(Gain = 21)                             |
 * |  20:16 | VREFLO_SEL    | 0x00(Open all VREFLO switches)           | 0x00(Open all VREFLO switches)              |
 * |  23    | VREFHI_SEL    | 0x00(Open VREF_LO_INT switch)            | 0x00(Open VREF_LO_INT switch)               |
 * +--------+---------------+------------------------------------------+---------------------------------------------+*/

#define  CY_CAPSENSE_REFGEN_DEFAULT_EN_CFG                 (0x00000001uL)
#define  CY_CAPSENSE_REFGEN_DEFAULT_RES_EN_CFG             (0x00000040uL)

#define CY_CAPSENSE_DEFAULT_CSD_REFGEN_CFG                 (CY_CAPSENSE_REFGEN_DEFAULT_EN_CFG |\
                                                                 CY_CAPSENSE_REFGEN_DEFAULT_RES_EN_CFG)


